Настройка

Необходимо задать IP-адреса для L3 интерфейсов. К слову, на маршрутизаторах интерфейсы и так L3, на коммутаторах с функцией маршрутизации же, интерфейсы по умолчанию L2. Чтобы сделать их L3 и задать IP, нужно ввести команду на интерфейсе:
no switchport
ip address [IP-адрес] [маска]

После настройки интерфейсов запускаем EIGRP
Cisco_2811_ons(config)#router eigrp [номер автономной системы]]

Cisco_2811_ons(config-router)#eigrp router-id [IP-адрес] /есть возможность задать IP-адрес, по которому это устройство будет идентифицироваться

Задаем сети(VLAN'ы), о которых будем рассказывать соседям:
Cisco_2811_ons(config-router)#network [сеть] [обратная маска]
Так же необходимо проанонсировать подсети L3 интерфейсов.

Зададим hello и hold таймеры (задается на интерфейсе и с обоих сторон значения должны совпадать):
Cisco_2811_ons(config-if)#ip hello-interval eigrp [номер автономной системы] [секунды]
Cisco_2811_ons(config-if)#ip hold-time eigrp [номер автономной системы]] [секунды]
Cisco рекомендует устанавливать hello-time 1 секунду, а hold-time 3 секунды.

Установим какие интерфейсы будет использовать EIGRP:
Cisco_2811_ons(config-router)#passive-interface default
Cisco_2811_ons(config-router)#no passive-interface [интерфейс порта] [слот/номер]

Это тот минимум команд, после которых EIGRP должен у вас заработать :)

Траблшутинг

Чтобы посмотреть список соседей EIGRP:
Cisco_2811_ons#sh ip eigrp neighbors

Просмотр маршрутов:
Cisco_2811_ons#sh ip route
Cisco_2811_ons#sh ip route eigrp [номер автономной системы]

Дебаг:
Cisco_2811_ons#debug eigrp [номер автономной системы] [что смотреть]
